Revit 2027 API
TextListStyle Enumeration
 Supported styles of text list paragraphs.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum TextListStyle
Public Enumeration TextListStyle
public enum class TextListStyle
type TextListStyle
Members
Member name | Value | Description
Bullet | 1 |  Indicates a list that uses standard bullets.
LetterLowercase | 3 |  Indicates a list that uses lowercase letters.
LetterUppercase | 4 |  Indicates a list that uses uppercase letters.
None | 0 |  Indicates that the paragraph is not a list.
NumberArabic | 2 |  Indicates a list that uses arabic numbers.
NumberRomanLowercase | 5 |  Indicates a list that uses lowercase Roman numbers.
NumberRomanUppercase | 6 |  Indicates a list that uses uppercase Roman numbers.
See Also
Reference
Autodesk.Revit.DB Namespace